w7/w7d1/pokedex/app/controllers/toys_controller.rb

  def update
    @toy = Toy.find(params[:id])
    if @toy.update(toy_params)
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["pokemon_id", 1], ["updated_at", "2015-08-04 00:03:13.302750"], ["id", 6]]